using InfoTabloServer.ViewModels;
using Xunit;

namespace InfoServerUnitTests
{
    public class TabloServerTests
    {
        [Fact]
        public void GetGroupMobileNonExistentDate()
        {
            string[] teachersList = new string[] {"Аладина О.Н.","Андреева Л.В.", "Андреянова О.А.", "Балакин О.Д.",
"Балышева Е.В.", "Белан В.Е.", "Беляев А.А.", "Бикимов А.Ж.", "Борисов В.В.", "Боровцова Е.В.", "Бухарова Э.Э.", "Вареников Л.А.",
"Великороднова А.В.", "Гиниятулина Н.В.", "Гонышев И.А.", "Дубская Е.С.", "Егурнова Е.Н.","Жеколдина Р.Р.", "Жукова О.В.","Журба С.С.",
"Зверева О.М.", "Зеленина С.В.", "Землянская К.В.", "Игликова А.Н.", "Илюсизова А.А.", "Имашева К.Б.", "Каблукова С.Ю.", "Калиберда Е.Л.",
"Колотвина М.Г.", "Кондратьева М.А.", "Коршиков Д.С.", "Кравченко И.П.", "Кравченко С.О.", "Крамаренко Т.С.", "Криворучко А.В.", "Литвиненко О.Д.",
"Лопатина М.М.", "Лукьяненко О.В.", "Лыжина Л.А.", "Лягута В.В.", "Малышев А.О.", "Мунасыпова К.Р.", "Муфазалова Ж.Б.", "Мякушина И.В.",
"Нащекина Ю.С.", "Никитина В.Л.", "Новиков Р.Е.", "Носова Ю.В.", "Нургалеева И.Ю.", "Павельев А.А.", "Палагина Л.В.", "Паламарчук И.В.",
"Парасовченко Г.И.", "Пахилько О.Н.", "Плотникова Ю.А.", "Раудина О.В.", "Сагдиев Т.Ф.", "Сазонов А.Н.", "Саликова М.А.", "Самсонова Д.А.",
"Селищева О.И.", "Сергеева Н.В.", "Силкина М.Г.", "Синельникова К.С.", "Синявская А.П.", "Спиридонов Н.А.", "Трушина И.Ю.", "Умирова А.Н.",
"Чебрукова Т.А.", "Швиндина Н.А.", "Шестаков В.А.", "Шестакова А.М."};

            string decipline = "История \r\nШвиндина Н.А. \r\nОсновной корпус-Аудитория 201";
            var expected = "Швиндина Н.А.";

            var testClass = new DayWeekClass { Day = decipline };

            var actual = testClass.GetDeciplineWithVerify(teachersList.ToList());

            Assert.Equal(expected, actual);
        }
    }
}